import 'package:bloodbank/view/widgets/text_widget.dart';
import 'package:flutter/material.dart';

import '../../model/instruction_model.dart';
import '../widgets/appbar_widget.dart';

class InstructionsScreen extends StatelessWidget {
  static const routeName = '/instructionsscreen';
  const InstructionsScreen({super.key});

  Widget titleText(String text) {
    return TextWidget(
      text: text,
      size: 30,
      textalign: TextAlign.center,
      weight: FontWeight.bold,
    );
  }

  Widget subTitleText(String text) {
    return TextWidget(
      text: text,
      size: 20,
      textalign: TextAlign.end,
      height: 1.3,
    );
  }

  @override
  Widget build(BuildContext context) {
    final List<InstructionModel> textList = [
      InstructionModel(
        text: 'معلومات عن التبرع بالدم',
        subtext:
            'إذا أراد الشخص التبرع بالدم فلا يجوز التبرع بالدم أكثر من مرتين إلى ثلاث مرات على الأكثر في السنة وبين كل مرة والأخرى فترة 16 أسبوع على الأقل وذلك لإتاحة الوقت اللازم حتى يتمكن الدم من توفير مخزون من الحديد في الجسم بين كل عملية تبرع وأخرى. مقدار التبرع بالدم في المرة الواحدة يقدر بمقدار نصف لتر من الدم والجسم يستطيع أن يعوض ذلك الدم المفقود خلال فترة قصيرة من الوقت. التبرع بالدم من الأمور المفيدة للشخص لأنها تعمل على تجديد الخلايا وتجديد الدم في الجسم. من المهم أن تكون على علم بفصيلة دمك لأن هناك فصائل دم تعطي الدم لكل الناس وهناك فصائل أخرى لا تعطي دم إلا من كان له نفس الفصيلة من الدم لذلك يجب معرفة فصيلة كل شخص لنفسه قبل التبرع.',
      ),
      InstructionModel(
        text: 'الأشخاص الغير صالحين للتبرع بالدم',
        subtext:
            'من كان يعاني من الأنيميا أو كان وزنه أقل من  50 كجم الحوامل لأن الجنين يتغذى ويتكون من دم الأم النساء في فترة الحيض أو النفاس لأنهم يفقدون كمية كبيرة من الدم في الجسم في تلك الفترة هناك بعض الأمراض التي تمنع الشخص من القيام بالتبرع بالدم لأنه قد يؤذي الشخص الذي يأخذ ذلك الدم ومن هذه الأمراض والإيدز وغيرها.',
      ),
      InstructionModel(
          text: 'نصائح قبل التبرع بالدم',
          subtext:
              'القيام بالتبرع بالدم يعمل على تنشيط خلايا الجسم ويعمل على تجديد الدم  ولكن يجب اتباع عدة أمور قبل القيام بالتبرع بالدم حفاظًا على سلامتكم ومنها \n \n يجب النوم عدة ساعات كافية قبل القيام بالتبرع بالدم  \n\n يجب الاهتمام بتناول الوجبات الغذائية المتوازنة المحتوية على كمية كبيرة من العناصر الغذائية قبل القيام بالتبرع بالدم  \n\n يجب الابتعاد عن الأطعمة الدسمة قبل التبرع بالدم. شرب كمية كبيرة من السوائل قبل التبرع بالدم بيوم كافي وكذلك يجب شرب كمية كبيرة من السوائل بعد القيام بالتبرع  \n\n الامتناع عن التدخين قبل التبرع بالدم لمدة يوم وكذلك الامتناع عن المشروبات الكحولية والمشروبات التي تحتوي على نسبة عالية من الكافيين لمدة ست ساعات على الأقل لتنقية الدم قبل التبرع به \n\n هناك بعض الأمراض التي يتعاطى لها بعض الأدوية تمنع الشخص من القيام بالتبرع بالدم فيجب مراعاة ذلك \n\n عدم تناول الأسبرين قبل التبرع بالدم لمدة يوم كامل. يجب عمل اختبار الدم قبل التبرع بالدم والتأكد من الشخص المتبرع ليس لديه أي أمراض خطيرة قد تنتقل عبر الدم.'),
      InstructionModel(
          text: 'نصائح بعد التبرع بالدم',
          subtext:
              'شرب كمية كبيرة من السوائل لتعويض كمية الدم التي فقدت مثل العصائر وغيرها \n\n  عدم ممارسة المجهود الزائد بعد القيام بعملية التبرع بالدم والالتزام بالراحة والهدوء \n\n الاستلقاء ورفع القدمين إلى أعلى \n\n تناول الأطعمة الغنية بالمعادن والفيتامينات وخاصة الحديد لتعويض كمية الدم المفقودة \n\n يجب العناية بالمنطقة التي تم التبرع بالدم منها حتى لا يحدث لها نزيف \n\n إذا حدثت أي أعراض جانبية بعد القيام بالتبرع بالدم مثل الهبوط أو ارتخاء العضلات يجب مراجعة الطبيب على الفور.')
    ];

    return Scaffold(
        body: ListView(
      shrinkWrap: true,
      children: [
        const AppbarWidget(text: 'نصائح وارشدات'),
        SizedBox(
          height: MediaQuery.of(context).size.height * 0.03,
        ),
        Padding(
          padding: const EdgeInsets.all(15.0),
          child: Column(children: [
            ...textList
                .map(
                  (e) => Column(
                    children: [
                      titleText(e.text),
                      SizedBox(
                        height: MediaQuery.of(context).size.height * 0.03,
                      ),
                      subTitleText(e.subtext),
                      SizedBox(
                        height: MediaQuery.of(context).size.height * 0.03,
                      ),
                    ],
                  ),
                )
                .toList(),
          ]),
        ),
      ],
    ));
  }
}

        // titleText('معلومات عن التبرع بالدم'),
        // SizedBox(
        //   height: MediaQuery.of(context).size.height * 0.03,
        // ),
//         subTitleText(
// 'إذا أراد الشخص التبرع بالدم فلا يجوز التبرع بالدم أكثر من مرتين إلى ثلاث مرات على الأكثر في السنة وبين كل مرة والأخرى فترة 16 أسبوع على الأقل وذلك لإتاحة الوقت اللازم حتى يتمكن الدم من توفير مخزون من الحديد في الجسم بين كل عملية تبرع وأخرى. مقدار التبرع بالدم في المرة الواحدة يقدر بمقدار نصف لتر من الدم والجسم يستطيع أن يعوض ذلك الدم المفقود خلال فترة قصيرة من الوقت. التبرع بالدم من الأمور المفيدة للشخص لأنها تعمل على تجديد الخلايا وتجديد الدم في الجسم. من المهم أن تكون على علم بفصيلة دمك لأن هناك فصائل دم تعطي الدم لكل الناس وهناك فصائل أخرى لا تعطي دم إلا من كان له نفس الفصيلة من الدم لذلك يجب معرفة فصيلة كل شخص لنفسه قبل التبرع.',
//         ),
//         SizedBox(
//           height: MediaQuery.of(context).size.height * 0.03,
//         ),
//         titleText('الأشخاص الغير صالحين للتبرع بالدم'),
//         subTitleText(
//           'من كان يعاني من الأنيميا أو كان وزنه أقل من  50 كجم الحوامل لأن الجنين يتغذى ويتكون من دم الأم النساء في فترة الحيض أو النفاس لأنهم يفقدون كمية كبيرة من الدم في الجسم في تلك الفترة هناك بعض الأمراض التي تمنع الشخص من القيام بالتبرع بالدم لأنه قد يؤذي الشخص الذي يأخذ ذلك الدم ومن هذه الأمراض والإيدز وغيرها.',
//         ),
//         SizedBox(
//           height: MediaQuery.of(context).size.height * 0.03,
//         ),
//         titleText('نصائح قبل التبرع بالدم'),
//         subTitleText(
          // 'إذا أراد الشخص التبرع بالدم فلا يجوز التبرع بالدم أكثر من مرتين إلى ثلاث مرات على الأكثر في السنة وبين كل مرة والأخرى فترة 16 أسبوع على الأقل وذلك لإتاحة الوقت اللازم حتى يتمكن الدم من توفير مخزون من الحديد في الجسم بين كل عملية تبرع وأخرى. مقدار التبرع بالدم في المرة الواحدة يقدر بمقدار نصف لتر من الدم والجسم يستطيع أن يعوض ذلك الدم المفقود خلال فترة قصيرة من الوقت. التبرع بالدم من الأمور المفيدة للشخص لأنها تعمل على تجديد الخلايا وتجديد الدم في الجسم. من المهم أن تكون على علم بفصيلة دمك لأن هناك فصائل دم تعطي الدم لكل الناس وهناك فصائل أخرى لا تعطي دم إلا من كان له نفس الفصيلة من الدم لذلك يجب معرفة فصيلة كل شخص لنفسه قبل التبرع.',
//         ),
//         SizedBox(
//           height: MediaQuery.of(context).size.height * 0.03,
//         ),
//         titleText('معلومات عن التبرع بالدم'),
//         subTitleText(
//           'إذا أراد الشخص التبرع بالدم فلا يجوز التبرع بالدم أكثر من مرتين إلى ثلاث مرات على الأكثر في السنة وبين كل مرة والأخرى فترة 16 أسبوع على الأقل وذلك لإتاحة الوقت اللازم حتى يتمكن الدم من توفير مخزون من الحديد في الجسم بين كل عملية تبرع وأخرى. مقدار التبرع بالدم في المرة الواحدة يقدر بمقدار نصف لتر من الدم والجسم يستطيع أن يعوض ذلك الدم المفقود خلال فترة قصيرة من الوقت. التبرع بالدم من الأمور المفيدة للشخص لأنها تعمل على تجديد الخلايا وتجديد الدم في الجسم. من المهم أن تكون على علم بفصيلة دمك لأن هناك فصائل دم تعطي الدم لكل الناس وهناك فصائل أخرى لا تعطي دم إلا من كان له نفس الفصيلة من الدم لذلك يجب معرفة فصيلة كل شخص لنفسه قبل التبرع.',
//         ),
